Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/migrant_workers/employment_permits/spousal_work_permit_scheme.html.txt.tmx
Source language: en
Languages: ga

source: Most non-EEA nationals must have an employment permit in order to work in Ireland
ga: Caithfidh an chuid is mó de náisiúnaigh neamh-LEE cead fostaíochta a bheith acu chun oibriú in Éirinn

source: Under the Employment Permits Acts 2003–2014 there is a specific employment permit (EP) for spouses, partners and dependants of Critical Skills Employment Permit holders and researchers
ga: Faoi na hAchtanna um Cheadanna Fostaíochta 2003-2014, tá cead fostaíochta (CF) ar leith ann do chéilí, páirtnéirí agus cleithiúnaithe de chuid sealbhóirí agus taighdeoirí Cead Fostaíochta Scileanna Ríthábhachtacha

source: To be eligible for a Dependant/Partner/Spouse (DPS) EP the applicant must be legally resident in Ireland
ga: Chun bheith i dteideal CF Cleithiúnaí/Páirtnéara/Céile (CPC) a fháil, ní mór go mbeadh cónaí dleathach ar an iarratasóir in Éirinn

source: Normally, the dependant must be a family member aged under 18 – see ‘Who can apply’ in the Rules section below
ga: De ghnáth, ní mór go mbeidh an cleithiúnaí ina d(h)uine muinteartha faoi bhun 18 mbliana d’aois – féach ‘Cé is féidir iarratas a dhéanamh?

source: Since 1 October 2014, the Dependant/Partner/Spouse Employment Permit applies to spouses, recognised partners, civil partners and dependants of holders of Critical Skills Employment Permits, former Green Card permits and researchers
ga: Ón 1 Deireadh Fómhair 2014, baineann an Cead Fostaíochta Cleithiúnaí/Páirtnéara/Céile le céilí, páirtnéirí aitheanta, páirtnéirí sibhialta agus cleithiúnaithe de chuid sealbhóirí Ceadanna Fostaíochta Scileanna Ríthábhachtacha, iar-cheadanna an Chárta Ghlais agus taighdeoirí

source: The scheme makes it easier for eligible spouses, partners and dependants to access employment because:
ga: Cabhraíonn an scéim le céilí, páirtnéirí agus cleithiúnaithe incháilithe rochtain a fháil ar fhostaíocht mar gheall ar an méid a leanas:

source: • Employers do not have to advertise the job with Department of Social Protection employment services/EURES before making the Dependant/Partner/Spouse Employment Permit application – known as the labour market needs test
ga: • Ní gá d’fhostóirí an post a fhógairt le seirbhísí fostaíochta na Roinne Coimirce Sóisialaí/EURES sula ndéanann siad an t-iarratas ar Chead Fostaíochta Cleithiúnaí/Páirtnéara/Céile – ar a dtugtar tástáil riachtanas an mhargaidh shaothair

source: • The spouse, partner or dependant can apply for any job vacancy other than in a domestic setting, with the exception of certain carers
ga: • Féadfaidh an céile/páirtnéir nó cleithiúnaí iarratas a dhéanamh ar aon fholúntas poist seachas post i suíomh baile, seachas i gcás roinnt cúramóirí

source: • First applications and renewals for Dependant/Partner/Spouse Employment Permits are exempt from the usual application fee
ga: • Tá na chéad iarratais agus athnuachan ar Cheadanna Fostaíochta Cleithiúnaí/Páirtnéara/Céile díolmhaithe ón ngnáth-tháille iarratais

source: Spouses, partners and dependants of other employment permit holders
ga: Céilí, páirtnéirí agus cleithiúnaithe de chuid sealbhóirí ceadanna fostaíochta eile

source: Dependant/Partner/Spouse Employment Permits are not available to spouses, partners and dependants of holders of General Employment Permits (formerly work permits) or other types of employment permit
ga: Níl fáil ar Cheadanna Fostaíochta Cleithiúnaí/Páirtnéara/Céile ag céilí, páirtnéirí agus cleithiúnaithe de chuid sealbhóirí Ceadanna Fostaíochta Ginearálta (ceadanna oibre roimhe seo) nó saghsanna eile de chead fostaíochta

source: They must apply for an employment permit in their own right
ga: Caithfidh siad iarratas a dhéanamh ar chead fostaíochta as a stuaim féin

source: Applying for a General Employment Permit means:
ga: Beidh an méid a leanas i gceist má dhéantar iarratas ar Chead Fostaíochta Ginearálta:

source: • A labour market needs test will be required
ga: • Teastóidh tástáil riachtanas an mhargaidh shaothair

source: • Fees are payable when applying for or renewing an employment permit
ga: • Tá táillí le híoc nuair a bhíonn iarratas á dhéanamh ar chead fostaíochta a athnuachan

source: • Applications for General Employment Permits will not be considered for occupations listed as ineligible for employment permits
ga: • Ní dhéanfar breithniú ar Cheadanna Fostaíochta Ginearálta i dtaobh gairmeacha atá liostaithe amhail bheith neamh-incháilithe do cheadanna fostaíochta

source: Dependant/Partner/Spouse Employment Permits apply only to spouses, partners or dependants legally resident in Ireland
ga: Baineann Ceadanna Fostaíochta Cleithiúnaí/Páirtnéara/Céile le céilí, páirtnéirí nó cleithiúnaithe amháin a bhfuil cónaí dleathach orthu in Éirinn

source: Applications for spouses, partners or dependants living outside Ireland must go through the normal employment permit procedures
ga: Ní mór d’iarratais ar chéilí, páirtnéirí nó cleithiúnaithe a chónaíonn lasmuigh d’Éirinn gabháil trí na gnáthnósanna imeachta um chead fostaíochta

source: In order to be eligible to apply for a Dependant/Partner/Spouse Employment Permit the following criteria must be met:
ga: Le bheith i dteideal iarratas a dhéanamh ar Chead Fostaíochta Cleithiúnaí/Páirtnéara/Céile, is gá na critéir a leanas a chomhlíonadh:

source: (a) The applicant and the employment permit holder must be married, in a recognised partnership or in a civil partnership (as recognised by the Department of Justice and Equality)
ga: (a) Ní mór don iarratasóir agus sealbhóir an cheada fostaíochta a bheith pósta, i bpáirtnéireacht aitheanta nó i bpáirtnéireacht shibhialta (arna haithint ag an Roinn Dlí agus Cirt agus Comhionannais)

source: In general, a dependant must be a family member who is unmarried and aged under 18 - see 'Dependants' below
ga: Go ginearálta, ní mór go mbeidh cleithiúnaí ina d(h)uine muinteartha nach bhfuil pósta agus faoi bhun 18 mbliana d’aois – féach ‘Cleithiúnaithe’ thíos

source: (b) The employment permit holder must have one of the following:
ga: (b) Ní mór go mbeidh ceann amháin den mhéid a leanas ag sealbhóir an cheada fostaíochta:

source: • A valid Critical Skills EP
ga: • CF bailí Scileanna Ríthábhachtacha

source: • A valid Green Card permit
ga: • Cead bailí an Chárta Ghlais

source: • A valid employment permit or hosting agreement in respect of a researcher position
ga: • Cead fostaíochta bailí nó comhaontú óstála i dtaca le post taighdeora

source: (c) The employment permit holder must still be working within the terms of their permit
ga: (c) Ní mór go bhfuil sealbhóir an cheada fostaíochta fós ag oibriú laistigh de théarmaí a c(h)eada

source: Spouses, partners and dependants of people who once held Critical Skills, Green Card or researcher permits but who have now got permission to work in Ireland without a permit, may also be eligible for a Dependant/Partner/Spouse Employment Permit
ga: Ina theannta sin, d’fhéadfadh céilí, páirtnéirí agus cleithiúnaithe daoine a mbíodh ceadanna fostaíochta Scileanna Ríthábhachtacha, an Cárta Glas nó ceadanna taighdeora acu roimhe seo ach a bhfuil cead faighte anois acu chun oibriú in Éirinn gan chead, a bheith i dteideal Cead Fostaíochta Cleithiúnaí/Páirtnéara/Céile a fháil

source: The following employment permit arrangements apply to the Dependant/Partner/Spouse Employment Permit
ga: Beidh na socruithe cead fostaíochta a leanas i gceist leis an gCead Fostaíochta Cleithiúnaí/Páirtnéara/Céile

source: • Either the employer or employee can apply for the employment permit, based on an offer of employment
ga: • Féadfaidh an fostóir nó an fostaí iarratas a dhéanamh ar an gcead, bunaithe ar thairiscint fostaíochta

source: • The employment permit is granted to the employee and includes a statement of the employee's rights and entitlements
ga: • Deonaítear an cead don fhostaí agus áirítear leis ráiteas ar chearta agus teidlíochtaí an fhostaí.Seoltar cóip den chead fostaíochta chuig an bhfostóir

source: • The employer is prohibited from deducting recruitment expenses from the employee's pay or retaining the employee's personal documents
ga: • Cuirtear cosc ar an bhfostóir ó chostais earcaíochta a bhaint ó phá an fhostaí nó cáipéisí pearsanta an fhostaí a choimeád

source: The spouse, partner or dependant must have a job offer and must have the qualifications, skills and experience required for the job
ga: Ní mór go bhfuil tairiscint poist ag an gcéile, páirtnéir nó cleithiúnaí agus ní mór go bhfuil na cáilíochtaí, scileanna agus taithí a theastaíonn don phost acu

source: They must be directly employed and paid by their employer in Ireland
ga: Ní mór go mbíonn siad fostaithe agus íoctha go díreach ag a bhfostóir in Éirinn

source: Job offers from recruitment agencies and other intermediaries are not acceptable under the scheme
ga: Ní ghlactar le tairiscintí poist ó ghníomhaireachtaí earcaíochta agus ó idirghabhálaithe eile faoin scéim

source: They may work for a minimum of 10 hours a week
ga: Féadfaidh siad oibriú ar feadh 10 n-uaire an chloig sa tseachtain ar a laghad

source: The pay can be less than €30,000 a year but they must be paid at least the National Minimum Wage hourly rate
ga: Féadfaidh an pá a bheith faoi bhun €30,000 sa bhliain ach ní mór an tÍosráta Náisiúnta Pá san Uair, ar a laghad, a íoc leo

source: The employer must be trading in Ireland, registered with Revenue and with the Companies Registration Office
ga: Ní mór go mbeidh an fostóir ag trádáil in Éirinn agus a bheith cláraithe leis an Oifig um Chlárú Cuideachtaí

source: A Dependant/Partner/Spouse Employment Permit will not be issued to companies where the granting of the permit would mean that more than 50% of the employees would be non-EEA nationals
ga: Ní dheonófar Cead Fostaíochta Cleithiúnaí/Páirtnéara/Céile do chuideachtaí dá mbeadh breis agus 50% de na fostaithe ina náisiúnaigh neamh-LEE mar gheall ar an gcead a dheonú

source: This requirement may be waived if the applicant will be the sole employee of the employer
ga: Féadtar an ceanglas seo a tharscaoileadh má bheidh an t-iarratasóir fostaí aonair an fhostóra

source: Dependant/Partner/Spouse Employment Permits are available only to dependent unmarried children aged under 18, who are resident in Ireland as family members of the employment permit holder
ga: Níl fáil ar Cheadanna Fostaíochta Cleithiúnaí/Páirtnéara/Céile ach ag leanaí neamhphósta faoi bhun 18 mbliana d’aois, a chónaíonn in Éirinn mar dhaoine muinteartha de shealbhóir an cheada fostaíochta

source: In exceptional cases Dependant/Partner/Spouse Employment Permits may be available to dependants aged over 18, who became legally resident in Ireland before the age of 18
ga: I gcásanna eisceachtúla, d’fhéadfadh go mbeadh an Cead Fostaíochta Cleithiúnaí/Páirtnéara/Céile ar fáil ag cleithiúnaithe os cionn 18 mbliana d’aois, a raibh cónaí dleathach orthu in Éirinn roimh aois 18 mbliana

source: The Dependant/Partner/Spouse Employment Permit is normally issued for the period up to the expiry date of the Certificate of Registration of the employment permit holder
ga: Is gnách go n-eisítear an Cead Fostaíochta Cleithiúnaí/Páirtnéara/Céile don tréimhse a fhad le héag chárta clárucháin Bhiúró Náisiúnta Inimirce an Gharda Síochána (BNIGS) de chuid shealbhóir an cheada fostaíochta

source: It can then be renewed - see 'How to apply' below
ga: Féadtar é a athnuachan – féach ‘Conas iarratas a dhéanamh’ thíos

source: If you have completed 5 consecutive years’ work on an employment permit you will no longer need a permit to work in Ireland
ga: Má chríochnaigh tú 5 bliana oibre as a chéile ar chead fostaíochta, ní theastóidh cead uait a thuilleadh chun oibriú in Éirinn

source: You should contact your local immigration officer to change your immigration permission
ga: Ba cheart duit teagmháil a dhéanamh le d’oifigeach áitiúil inimirce chun do chead inimirce a athrú

source: Someone working on a Dependant/Partner/Spouse Employment Permit is expected to stay with the original employer for 12 months unless there are exceptional circumstances
ga: Bítear ag súil leis go bhfanfaidh duine a oibríonn agus Cead Fostaíochta Cleithiúnaí/Páirtnéara/Céile acu, leis an bhfostóir tosaigh ar feadh 12 mhí mura bhfuil cúinsí eisceachtúla i gceist

source: After that it is possible to change job provided a new application for a Dependant/Partner/Spouse Employment Permit is made
ga: Ina dhiaidh sin, is féidir post a athrú, a fhad agus a dhéantar iarratas nua ar Chead Fostaíochta Cleithiúnaí/Páirtnéara/Céile

source: There is no fee for Dependant/Partner/Spouse Employment Permit applications or renewals
ga: Níl aon táille ar iarratais nó athnuachan ar Cheadanna Fostaíochta Cleithiúnaí/Páirtnéara/Céile

source: Either the employer or the employee can apply to the Employment Permits Section of the Department of Jobs, Enterprise and Innovation
ga: Féadfaidh an fostóir nó an fostaí iarratas a dhéanamh ar an Rannóg Ceadanna Fostaíochta den Roinn Post, Fiontar agus Nuálaíochta

source: Since 5 September 2016, you apply online with the required documentation, using the Employment Permits Online System (EPOS)
ga: Ó 5 Meán Fómhair 2016, féadtar iarratais a dhéanamh ar líne leis an cháipéisíocht tacaíochta a theastaíonn agus leas á bhaint as an gCóras Ceadanna Fostaíochta Ar Líne (CCFA)

source: Processing and reviews: You can check the status of your application through the online status enquiry facility
ga: Próiseáil agus athbhreithnithe: Féadfaidh tú stádas d’iarratas tríd an tsaoráid fhiosrúcháin faoi stádas ar líne a sheiceáil

source: The application processing times are on the Department’s website
ga: Tá na hamanna próiseála iarratais ar shuíomh gréasáin na Roinne

source: The official processing your application will either grant it or refuse it for specific reasons
ga: Déanfaidh próiseáil oifigiúil d’iarratais é a dheonú nó a dhiúltú ar údair shonracha

source: If your application is refused you may appeal the decision within 28 days, using the form to submit a decision for review
ga: Má dhiúltaítear d’iarratas, féadfaidh tú achomharc a dhéanamh laistigh de 28 lá, trí leas a bhaint as an bhfoirm chun cinneadh a sheoladh isteach a bhfuil athbhreithniú le déanamh air

source: Renewal: Either an employer or an employee can apply using the Employment Permits Online System (EPOS)
ga: Féadfaidh an fostóir nó an fostaí iarratas a dhéanamh ar athnuachan agus leas á bhaint as an gCóras Ceadanna Fostaíochta Ar Líne (CCFA)

source: When a Dependant/Partner/Spouse Employment Permit is issued to an eligible spouse, partner or dependant, they need to re-register with the Burgh Quay Registration Office (if living in Dublin) or the regional registration office or local Garda District Headquarters (if living outside Dublin)
ga: Nuair a eisítear Cead Fostaíochta Cleithiúnaí/Páirtnéara/Céile do chéile/páirtnéir nó cleithiúnaí incháilithe, is gá dó nó di athchlárú a dhéanamh le hOifig Chlárúcháin Cé an Bhúrcaigh (má tá cónaí air/uirthi i mBaile Átha Cliath) nó ag oifig chlárúcháin régiúnach nó Ceanncheathrú áitiúil Cheantar an Gharda Síochána (má tá cónaí air/uirthi lasmuigh de Bhaile Átha Cliath)

source: This is in order to obtain permission to remain in the State as an employee
ga: Is amhlaidh atá seo chun cead a fháil chun fanacht sa Stát mar fhostaí

source: It is important to do this as otherwise the spouse, partner or dependant will not have the correct immigration status
ga: Is tábhachtach chun seo a dhéanamh, mar mura ndéantar é, ní bheidh an stádas ceart inimirce ag an gcéile, páirtnéir nó cleithiúnaí

source: There is further information on Dependant/Partner/Spouse Employment Permits on the Department of Jobs, Enterprise and Innovation’s website
ga: Tá breis faisnéise ar fáil faoi Cheadanna Fostaíochta Cleithiúnaí/Páirtnéara/Céile ar láithreán gréasáin na Roinne Post, Fiontar agus Nuálaíochta
